1. List any five functions of the pandas library with execution.
1. read_csv()
2. head()
3. describe()
4. memory_usage()
5. astype()

Q2: Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
import pandas as pd
import numpy as np

In [5]:
column = ['a', 'b', 'c', 'd', 'e']
index =[0,1,2,3,4]

In [8]:
df1 = pd.DataFrame(np.random.rand(5, 5), 
        columns = column, index = index)

In [9]:
new_index=[1,3,5,7,9]

In [10]:
print(df1.reindex(new_index))

          a         b         c         d         e
1  0.689318  0.318149  0.100052  0.579779  0.192723
3  0.524003  0.902540  0.638602  0.153302  0.755167
5       NaN       NaN       NaN       NaN       NaN
7       NaN       NaN       NaN       NaN       NaN
9       NaN       NaN       NaN       NaN       NaN

In [11]:
#Q3:
data = {'values':[10,20,30,40,50]}

In [12]:
df=pd.DataFrame(data)

In [13]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [21]:
i=0
a=0
while(i<3):
    a=a+df.loc[i]
    i=i+1
print(a)

values    60
dtype: int64

In [32]:
#q4:
import pandas as pd 

d={"text":['naisargi','hariji','hari']}

In [33]:
df1= pd.DataFrame(d)

df1

In [35]:
df1['word_count']=df1['text'].str.len()

In [36]:
df1

       text  word_count
0  naisargi           8
1    hariji           6
2      hari           4

q5:
DataFrame.size()
The size property is used to get an int representing the number of elements in this object and Return the number of rows if Series. Otherwise, return the number of rows times the number of columns if DataFrame.
DataFrame.shape()
The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.

Q6: read_excel()

In [9]:
#Q7:
df2={'Email':["naisargi@gmail.com","hari@gmail.com"]}

In [10]:
d1=pd.DataFrame(df2)

In [11]:
d1

                Email
0  naisargi@gmail.com
1      hari@gmail.com

In [14]:
d1['username']=d1['Email'].str.split('@').str[0]

In [15]:
d1

                Email  username
0  naisargi@gmail.com  naisargi
1      hari@gmail.com      hari

A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

In [16]:
s={'A':[3,8,6,2,9],'B':[5,2,9,3,1] , 'C':[1,7,4,5,2]}

In [17]:
dt=pd.DataFrame(s)

In [18]:
dt

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [22]:
dt[(dt['A']>5) & (dt['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [25]:
dt.loc[[1,4],['A','B','C']]

   A  B  C
1  8  2  7
4  9  1  2

In [38]:
#Q9

g={'values':[4,5,6,7,8,9]}

In [39]:
dfs=pd.DataFrame(g)

In [29]:
dfs

   values
0       4
1       5
2       6
3       7
4       8
5       9

In [42]:
dfs['values'].mean()

6.5

In [32]:
dfs['values'].median()

6.5

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

In [33]:
dfs['values'].std()

1.8708286933869707

In [1]:
f={"date":['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}

In [3]:
import pandas as pd
fa=pd.DataFrame(f)

In [4]:
fa

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [9]:
fa['date'] = pd.to_datetime(fa['date'])

In [14]:
fa['weekday'] = fa['date'].dt.day_name()

In [12]:
fa

        date    weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [30]:
#Q12:
q={"date":['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-07-05','2021-09-09']}

In [19]:
sa

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5   2023-07-5
6   2021-09-9

In [21]:
sa=pd.DataFrame(q)

In [29]:
sa[ (sa['date'] > '2023-01-01') & (sa['date'] < '2023-01-31' )]

        date
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Q13: pandas and numpy